In [1]:
# just learning the db basics with pandas

In [33]:
import pandas as pd
import sqlite3
import numpy as np

In [58]:
con = sqlite3.connect("./parkdb.db")

In [98]:
df = pd.read_sql_query("SELECT * from parks", con)

In [99]:
df.head()

,id,name,latitude,longitude,state,comments,visited
0,4215,Warminster Community Park,40.199393,-75.064304,PA,,1

In [89]:
parkDict = {'id' : np.random.randint(5000),
         'name' : 'Warminster Community Park',
         'latitude' : 40.199393,
         'longitude' : -75.064304,
         'state' :  'PA',
         'comments' : '',
         'visited' : 1}

In [90]:
newDF = pd.DataFrame(parkDict,index=[0])

In [91]:
newDF = newDF.reset_index(drop=True,inplace=False)

In [92]:
newDF.head()

,id,name,latitude,longitude,state,comments,visited
0,4215,Warminster Community Park,40.199393,-75.064304,PA,,1

In [93]:
df = df.append(newDF)

In [95]:
df.head()

,id,name,latitude,longitude,state,comments,visited
0,4215,Warminster Community Park,40.199393,-75.064304,PA,,1

In [96]:
df.to_sql("parks", con, if_exists="append",index=False)   # first argument must be table name

In [100]:
con.close()